{"title":"Tunnel Confusion | Manic Miners custom level","identifier":"ManicMiners-level-2020-TunnelConfusion","creator":"Ichor","date":"2020-04-10T00:00:00Z","downloadCount":13,"description":"\"Tunnel Confusion\" by Ichor, a custom level for Manic Miners . Objectives: Locate the lost Miner, Tunnel Scout, and Tool Store; Build a Geological Center and a Super Teleport Size: 64x64 Here's version 3, as there were requests for improvement. Enjoy! (Note: the previous versions of this level have been removed from this channel.) \"Well, Cadet, our situation is rapidly worsening. The entire tunnel system in this area has collapsed and left a small team of Miners in a small cavern! This small team lost contact with the best pilot in their squad, who was looking for a lost Tunnel Scout as a result of a teleporter malfunction. We need to work fast, though - the available air is also being quickly used up, and we need to work fast to find our way back to our main HQ! After you recover the lost Tunnel Scout, meet up with the lost Miner, and make it back to our HQ, we need to construct a Super Teleport and a Geological Center. This will help us learn more about the cause of the collapse. Good luck!\" (Quick note: saved in the April 9th 2020 snapshot build)","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-TunnelConfusion","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-TunnelConfusion/ManicMiners-level-2020-TunnelConfusion_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-TunnelConfusion/TunnelConfusion.dat"},{"title":"Hidden Slackers | Manic Miners custom level","identifier":"ManicMiners-level-2021-Hidden_Slackers","creator":"EristheSlackWyrm","date":"2021-03-22T00:00:00Z","downloadCount":49,"description":"\"Hidden Slackers\" by EristheSlackWyrm, a custom level for Manic Miners . Objectives: Find the slackers who ran off; Collect 40 crystals Size: 24x24 A classic simple and easy \"Find some stuff\" level. Made just for practising designing caves","detailsUrl":"https://archive.org/details/ManicMiners-level-2021-Hidden_Slackers","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2021-Hidden_Slackers/ManicMiners-level-2021-Hidden_Slackers_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2021-Hidden_Slackers/Hidden_Slackers.dat"},{"title":"Water Works 2 | Manic Miners custom level","identifier":"ManicMiners-level-2020-WaterWorks2","creator":"Ruinae Retroque Rursus","date":"2020-02-29T00:00:00Z","downloadCount":52,"description":"\"Water Works 2\" by Ruinae Retroque Rursus, a custom level for Manic Miners based on the level Water Works from LEGO Rock Raiders . Objectives: Collect 25 crystals Size: 64x64 Water Works 2 OK, Rock Raider - are you ready for the next mission? A flood has washed through the cavern and created an underground lake! You must establish our Rock Raider HQ and build the Docks. Once you have achieved this, get a Rapid Rider and bring back any Energy Crystals in the cavern. We need a total of twenty-five Energy Crystals. Again, I found Water Works a terrible, ghastly map that was 0% fun to play. So I changed the heck out of it and it plays totally differently. You'll now need to go island-hopping to pick up the crystals you need - and thanks to MM's new vehicles this is a thousand times less painful than LRR.","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-WaterWorks2","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-WaterWorks2/ManicMiners-level-2020-WaterWorks2_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-WaterWorks2/WaterWorks2.dat"},{"title":"Cliff | Manic Miners custom level","identifier":"ManicMiners-level-2019-Cliff","creator":"Ruinae Retroque Rursus","date":"2019-08-01T00:00:00Z","downloadCount":77,"description":"\"Cliff\" by Ruinae Retroque Rursus, a custom level for Manic Miners . Objectives: Collect 5 crystals Size: 24x24 In case you want it, have this","detailsUrl":"https://archive.org/details/ManicMiners-level-2019-Cliff","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2019-Cliff/ManicMiners-level-2019-Cliff_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2019-Cliff/Cliff.dat"},{"title":"Lost | Manic Miners custom level","identifier":"ManicMiners-level-2020-Lost","creator":"NuvaHammer","date":"2020-06-01T00:00:00Z","downloadCount":56,"description":"\"Lost\" by NuvaHammer, a custom level for Manic Miners . Objectives: Get Out Size: 32x32 Miner Diary Day: Unknown We cannot get out. we cannot get out. The walls close in around me. Hope is fading now. Five went searching for a way out, None returned. I am alone. I cannot get out. The end comes soon. I hear drums, drums in the deep. Experimental Version 5-09 Required","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-Lost","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-Lost/ManicMiners-level-2020-Lost_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-Lost/Lost.dat"},{"title":"MapGen9 | Manic Miners custom level","identifier":"ManicMiners-level-2020-MapGen9","creator":"wodzu_93","date":"2020-07-09T00:00:00Z","downloadCount":56,"description":"\"MapGen9\" by wodzu_93, a custom level for Manic Miners . Objectives: Collect 25 crystals Size: 32x32 I love the map generator! This is 9th level I played today, and this last one was a real challenging one - very scarce crystals, low O2, very little initial building space. If monsters had been active, it would be stupidly hard to complete.","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-MapGen9","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-MapGen9/ManicMiners-level-2020-MapGen9_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-MapGen9/MapGen9.dat"},{"title":"Deep Freeze | Manic Miners custom level","identifier":"ManicMiners-level-2020-DeepFreeze","creator":["Batman1138","wodzu_93"],"date":"2020-07-10T00:00:00Z","downloadCount":128,"description":"\"Deep Freeze\" by Batman1138 and wodzu_93, a custom level for Manic Miners . An edited version of MapGen9 . Objectives: Collect 25 crystals Size: 32x32 A polished up MapGen9 originally made by wodzu_93 Deep Freeze I hope you've dressed warmly, Cadet. Scanners detected a decent haul of crystals deep in this icy sector. Drill deep and be mindful of your air supply; build a Support Station and save up some crystals for some drilling vehicles. Start clearing the cavern and proceed to collect 25 Energy Crystals.","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-DeepFreeze","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-DeepFreeze/ManicMiners-level-2020-DeepFreeze_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-DeepFreeze/DeepFreeze.dat"},{"title":"Delta Quadrant | Manic Miners custom level","identifier":"ManicMiners-level-2020-DeltaQuadrant","creator":"Mondkalb","date":"2020-04-15T00:00:00Z","downloadCount":43,"description":"\"Delta Quadrant\" by Mondkalb, a custom level for Manic Miners . Objectives: Collect 200 crystals and 60 studs; Find Lost Delta Quadrant HQ Size: 64x64 Cadet, the Delta Quadrant expedition was a total failure. The crew turned out to be too inexperienced, so it falls on you to rectify this situation. Your primary task is to find the lost quadrant's HQ and to teleport their equipment back to the LMS Explorer, then continue their original mission. This means that not only do you have to deliver your own quota of 100 crystals and 30 studs, but also make up for the lost team, effectively doubling your workload to 200 crystals and 60 studs! This cave system already wiped out one crew, so be careful and deploy the necessary expert knowledge to get this job done. It's a classic rock raiders level design with a few difficulties. Please @ me directly for feedback.","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-DeltaQuadrant","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-DeltaQuadrant/ManicMiners-level-2020-DeltaQuadrant_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-DeltaQuadrant/DeltaQuadrant.dat"},{"title":"Fiery Recovery | Manic Miners custom level","identifier":"ManicMiners-level-2020-Fiery_Recovery","creator":"Batman1138","date":"2020-07-08T00:00:00Z","downloadCount":127,"description":"\"Fiery Recovery\" by Batman1138, a custom level for Manic Miners . Objectives: Find 10 ost Miners; Find the lost Geological Center; Collect 250 crystals Size: 96x96 Fiery Recovery Cadet! We have an emergency! Team Bravo is in deep trouble! A shift in the tectonic plates many kilometers above caused several U-Quakes across the region. A deluge of collapsing rock and cave-ins affected the area. The base is in shambles and 10 of our miners are trapped in the deep, labyrinthian cave system! Hurry! Mount a rescue operation and recover the missing Rock Raiders! Uncovering the Geological Center may help with your search! Once the team is safe and sound, continue their work in recovering 250 energy crystals.","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-Fiery_Recovery","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-Fiery_Recovery/ManicMiners-level-2020-Fiery_Recovery_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-Fiery_Recovery/Fiery_RecoveryV2.dat"},{"title":"Erode Works – BAZ Edition | Manic Miners custom level","identifier":"ManicMiners-level-2020-Erode_Works-BAZ","creator":["Batman1138","Baz"],"date":"2020-07-31T00:00:00Z","downloadCount":124,"description":"\"Erode Works – BAZ Edition\" by Batman1138, a custom level for Manic Miners . Ported from Baz's Mod , a mod for the original LEGO Rock Raiders. Objectives: Find the Safe Cavern; Collect 100 crystals Size: 40x40 Erode Works - BAZ Edition In the OG game (and mod), you utilized the S/LMLCs to traverse lava; in MM, that is no longer possible.......unless they are carried by Tunnel Transports 😉 \"We had just begun mining activities in a deeper cavern, when disaster struck! Molten lava and magma is slowly eroding the perimeter of Rock Raider HQ. We have located another cavern nearby that is safe, but the ship's transporter is being repaired and cannot be used. Try to prevent the magma from advancing by building a perimeter Power Path around Rock Raider HQ. There is lots of Hard Rock between the safe cavern and us, and we must use Dynamite and Large Drilling Vehicles to blast through. We can't tell how eroded the unopened chambers are with lava, so you may need to utilize Mobile Laser Cutters carried by Tunnel Transports! Be careful down there! Once you have made it there safely, resume mining and collect one hundred Energy Crystals.\"","detailsUrl":"https://archive.org/details/ManicMiners-level-2020-Erode_Works-BAZ","xmlFileUrl":"https://archive.org/download/ManicMiners-level-2020-Erode_Works-BAZ/ManicMiners-level-2020-Erode_Works-BAZ_files.xml","downloadUrl":"https://archive.org/download/ManicMiners-level-2020-Erode_Works-BAZ/Erode_Works-BAZ.dat"},